"""
Реалізувати програму, в якій кожен з алгоритмів сортування оформити як окрему
функцію. Проілюструвати механізм використання параметрів різних типів. Забезпечити
підрахунок числа необхідних порівнянь, числа обмінів і часу роботи кожної функції,
сформувавши функції оцінки ефективності методів сортування. Підготувати єдині для
всіх алгоритмів тестові вихідні дані:

• згенерована послідовність псевдовипадкових чисел, достатня для оцінки
швидкості роботи алгоритму сортування (близько 100000 цілих чисел);

• вихідна послідовність псевдовипадкових чисел, відсортована будь-яким методом
в порядку зростання;

• вихідна послідовність псевдовипадкових чисел, відсортована будь-яким методом
в порядку за спаданням;

• забезпечити програмну можливість вибору введення вихідних даних з клавіатури
до 30 вихідних чисел.

Для програми привести лістинг з результати роботи:

• вихідний масив (вивести на екран для випадку введення вихідних даних з
клавіатури);

• відсортований масив (для випадку введення вихідних даних з клавіатури один
екземпляр відсортованого масиву вивести на екран);

• показники функції оцінки ефективності методів сортування (вивести на екран).
Виконати сортування масиву цілих чисел Ai ,i = 0,N −1

в порядку зростання / за спаданням елементів.
Найпростіші алгоритми сортування:
• сортування бульбашкою (bubble sort);
• сортування вибором (selection sort);
• сортування вставками (insertion sort).

Олійник Богдан Сергійович 122\Д
"""
import numpy as np              #імпорт функцій Numpy
import random                   #імпорт функцій Random
import timeit                   #імпорт функцій Timeit


def bbuble_sort(mylist):        # сортування бульбашкою
    exchange = 0                # щотчик обмінів
    count = 0                   # щотчик порівнянь
    last_item = len(mylist) - 1
    for i in range(0, last_item):               # проходим по спискам
        for x in range(0, last_item):           # проходим по спискам
            count += 1
            if mylist[x] > mylist[x + 1]:
                mylist[x], mylist[x + 1] = mylist[x + 1], mylist[x]
                exchange += 1
    print("Число порівнянь:", count)            #вивід даних
    print("Число обмінів:", exchange)           #вивід даних
    print(" ")

    return mylist


def sel_sort(array):                #сортування вибором
    exchange = 0                    # щотчик обмінів
    coun = 0                        # щотчик порівнянь
    for i in range(len(array) - 1): #проходим по спискам
        coun += 1
        m = i
        j = i + 1
        while j < len(array):
            if array[j] < array[m]:
                m = j
            j = j + 1
        array[i], array[m] = array[m], array[i]
        exchange += 1
    print("Число порівнянь:", coun)         #вивід даних
    print("Чсло обмінів:", exchange)        #вивід даних
    return array


def insertion(data):                # сортування вставками
    exchange = 0                    # щотчик обмінів
    count = 0                       # щотчик порівнянь
    for i in range(len(data)):      #проходим по спискам
        count += 1
        j = i - 1
        key = data[i]
        while data[j] > key and j >= 0:
            data[j + 1] = data[j]
            j -= 1
        data[j + 1] = key
        exchange += 1
    print("Число порівнянь:", count - 1)    #виводим дані
    print("Число обмінів:", exchange)       #виводим дані
    return data


while True:                                 # перевірки на правельність
    while True:
        try:
            choose = int(input("bubble sort - 1,selection sort - 2,insertion sort - 3,ваш вибір: ")) #вибираєм сортування
            if choose <= 3:                                                                         
                break
            else:
                choose = int(input("bubble sort - 1,selection sort - 2,insertion sort - 3,ваш вибір: "))
        except ValueError:                                                                          # якщо вводим букву видає "тільки цифри"
            print("Тільки цифри")
    flag = input(
        "Якщо ви хочите рандомні вихідні данні, натисніть «Enter». Для введення вручну натисніть любу другу клавішу: ")
    print("")
    if flag == "":
        while True:
            try:
                b = int(input("Введіть кількість яка буде генеруватися: ")) # виводим дані 
                break
            except ValueError:
                print("Тільки цифри")

        a = np.zeros(b, dtype=int)
        while True:
            try:
                d1 = int(input('Ліва грань: '))             # вводим дані
                d2 = int(input('Права грань: '))            # вводим дані
                break
            except ValueError:
                print("Тільки цифри")
        if d1 > d2: #якщо вести некоректно границі програма їх поміняє
            buf = d1
            d1 = d2
            d2 = buf
        print("Ви вели не коректоно границі ми їх поміняли для того щоб програма працювала", d1, d2)

        for i in range(b):
            a[i] = random.randint(d1, d2)

    else:
        while True:# перевірка на правельність введення
            try:
                b = int(input("Введіть кількість яка буде генеруватися: "))                  # вводим дані
                if b <= 30:
                    break
                else:
                    b = int(input("Введіть кількість яка буде генеруватися: "))             # вводим дані
            except ValueError:
                print("Тільки цифри")
        a = np.zeros(b, dtype=int)
        for i in range(b):
            a[i] = int(input(f'Enter {i + 1} element: '))

    if choose == 1:                                                                         # якщо вибрали бульбашковий вид сортування
        print("Старий список", a)
        print(" ")
        new = bbuble_sort(a)
        print("Відсортований від меншого до більшого", new)
        print(" ")
        s = np.array(a)
        x = s[::-1]
        print("Від більшого до меншого", x)
        print(" ")
    if choose == 2:                                                                         # якщо вибрали сортування вибором
        print("Старий список", a)
        print(" ")
        new = sel_sort(a)
        print("Відсортований від меншого до більшого", new)
        print(" ")
        s = np.array(a)
        x = s[::-1]
        print("Від більшого до меншого", x)
        print(" ")
    if choose == 3:                                                                         # якщо вибрали сортування вставками
        print("Старий список", a)
        print(" ")
        new = insertion(a)
        print("Відсортований від меншого до більшого", new)
        print(" ")
        s = np.array(a)
        x = s[::-1]
        print("Від більшого до меншого", x)
        print(" ")
    t = timeit.timeit('"-".join(str(n) for n in range(100))', number=10000)                 #таймер програми
    print(f"Програма виконувалася {t} секунд")
    print(" ")
    if input('Нажмите "Enter" (введите пусту строку (\'\')) для перезапуска: ') == '':      #перезагрузка програми
        continue
    break
